In [2]:
import pandas as pd

# create the first dataframe
data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
         'Age': [25, 30, 35]}
df1 = pd.DataFrame(data1)

# create the second dataframe
data2 = {'Name': ['Alice', 'Bob', 'David'],
         'Age': [25, 30, 40]}
df2 = pd.DataFrame(data2)

# merge the two dataframes
merged_df = pd.merge(df1, df2, on='Name', how='outer', indicator=True)

# filter for rows with any column values not the same
diff_df = merged_df[merged_df['_merge'] != 'both']

In [3]:
merged_df

      Name  Age_x  Age_y      _merge
0    Alice   25.0   25.0        both
1      Bob   30.0   30.0        both
2  Charlie   35.0    NaN   left_only
3    David    NaN   40.0  right_only

In [4]:
diff_df

      Name  Age_x  Age_y      _merge
2  Charlie   35.0    NaN   left_only
3    David    NaN   40.0  right_only